<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Cisco Webex and imports it into Munki.
	
	Modify the ARCHITECTURE variable to determine whether the Intel (x64) or Apple Silicon (arm64) version of Webex is downloaded.
	
	Modify the ARCH variable to tell Munki if this version of Webex is supported on Intel (x86_64) or Apple Silicon (arm64).
	</string>
	<key>Identifier</key>
	<string>com.github.bryanheinz.munki.cisco-webex</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>arm64</string>
		<key>ARCH</key>
		<string>arm64</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>conferencing/webex</string>
		<key>NAME</key>
		<string>CiscoWebex</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Conference Software</string>
			<key>description</key>
			<string>Webex is an online conferencing solution by Cisco.</string>
			<key>developer</key>
			<string>Cisco</string>
			<key>display_name</key>
			<string>Webex</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>supported_architectures</key>
			<array>
				<string>%ARCH%</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.smithjw.download.webex</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
